Repository: 84000/data-translation-memory
Catalog: toh55_84000-the-teaching-on-the-effulgence-of-light.tmx
Source language: bo
Languages: en

source: །མིག་ཟད་མཐར་ནི་ལྟ་བས་ན།
en: Since they perceive the limit of the exhaustion of the eye,

source: །ཤིན་ཏུ་དང་བ་རྒྱུན་མི་འཆད།
en: Their faith will be uninterrupted.

source: །ཆོས་ལ་ཡིད་ཆེས་མི་འཇིགས་འཐོབ།
en: Will develop fearless trust in the Dharma;

source: །དགེ་འདུན་ཡིད་ཆེས་མི་འཇིགས་འཐོབ།
en: Will develop fearless trust in the Saṅgha;

source: །ཚུལ་ཁྲིམས་འཛིན་མེད་ཐོབ་པར་འགྱུར།
en: Will achieve discipline free from clinging;

source: །ངན་འགྲོའི་འདོད་ཆགས་སྤོང་བར་འགྱུར།
en: Will abandon desire that leads to the lower realms;

source: །འདོད་ཆགས་རྒྱུན་ནི་སྤོང་བར་བྱེད།
en: They will interrupt the stream of desire.

source: །ངན་འགྲོའི་ཞེ་སྡང་སྤོང་བར་འགྱུར།
en: Will abandon anger that leads to the lower realms;

source: །ཞེ་སྡང་རྒྱུན་ནི་སྤོང་བར་བྱེད།
en: They will interrupt the stream of anger.

source: །ངན་འགྲོའི་གཏི་མུག་སྤོང་བར་འགྱུར།
en: Will abandon ignorance that leads to the lower realms;

source: །གཏི་མུག་རྒྱུན་ནི་སྤོང་བར་བྱེད།
en: They will interrupt the stream of ignorance.

source: །བྱང་ཆུབ་ཡེ་ཤེས་དག་ལ་གནས།
en: Will dwell within awakened wisdom;

source: །བྱང་ཆུབ་ཡེ་ཤེས་རྒྱུན་མི་འཆད།
en: The flow of their awakened wisdom will be uninterrupted. “The same teaching concerning the exhaustion of the eye

source: །མིག་སྐྱེ་མཐའ་དང་མིག་གི་མཐའ།
en: Also applies to all the gateways—the limit of the arising of the eye,

source: །འཇུག་པ་དང་ནི་རབ་དབེན་དང་། །ཡོད་པ་ཉིད་དུ་མི་འགྱུར་དང་། །མི་སྐྱེ་རབ་ཏུ་ཞི་བ་དང་། །འདི་ལ་སོགས་པའི་སྒོ་རྣམས་ཀྱང་། །ཐམས་ཅད་མིག་ཟད་འདྲ་བར་བསྟན།
en: Its limit, its cognition, its disengagement, its nonexistence, Its unborn nature, its peace, and so forth.

source: །གང་ཞིག་མིག་ཟད་མཐར་སྲེད་པ།
en: “Those who crave the limit of the exhaustion of the eye

source: །དེ་ནི་རྟག་ཏུ་ཐེ་ཚོམ་མེད།
en: Will always be free of doubts

source: །དེ་ལྟར་ཐེ་ཚོམ་མེད་པའི་ཕྱིར།
en: And will therefore achieve

source: །སངས་རྒྱས་རྫུ་འཕྲུལ་ཐོབ་པར་འགྱུར།
en: The Buddha’s miraculous powers.

source: །སངས་རྒྱས་རྫུ་འཕྲུལ་འཐོབ་པར་འགྱུར།
en: The Buddha’s miraculous powers.

source: །གང་ཞིག་མིག་གི་མཐའ་སྲིད་པ།
en: “Those who crave the limit of the eye

source: །གང་ཞིག་མིག་གི་འཇུག་སྲེད་པ།
en: “Those who crave the cognition of the eye

source: །གང་ཞིག་མི་དབེན་རབ་སྲེད་པ།
en: “Those who crave the disengagement of the eye

source: །གང་ཞིག་མིག་མི་སྐྱེ་སྲེད་པ།
en: “Those who crave the unborn nature of the eye

source: །གང་ཞིག་མིག་མེད་ལ་སྲེད་པ།
en: “Those who crave the nonexistence of the eye

source: །གང་ཞིག་མིག་ཞི་ལ་སྲེད་པ།
en: “Those who crave the quiescence of the eye

source: །སྒྲ་དང་མིང་གི་བར་དུ་ཡང་། །ཐམས་ཅད་དེ་བཞིན་སྦྱར་བར་བྱ།
en: Up to words and names.

source: །མིག་སྐྱེ་དཔག་མེད་གང་སྐྱེད་པ།
en: “Those who generate the boundless arising of the eye

source: །ཡེ་ཤེས་དཔག་མེད་སྐྱེད་པར་བྱེད།
en: Generate boundless wisdom;

source: །ཡེ་ཤེས་དཔག་ཏུ་མེད་པའི་ཕྱིར།
en: Since wisdom is boundless,

source: །ཆོས་འདི་བསྟན་པའང་དེ་བཞིན་ནོ།
en: So too is this Dharma teaching.

source: །མིག་ཟད་དཔག་མེད་གང་ཤེས་པ།
en: “Those who know the boundless exhaustion of the eye

source: །མིག་ལ་སྒྲིབ་པ་མེད་པར་འགྱུར།
en: Will be unobscured with regard to the eye

source: །དེ་ལྟར་སྒྲིབ་པ་མེད་པའི་ཕྱིར།
en: And will therefore achieve

source: །སངས་རྒྱས་མཁྱེན་པ་ཐོགས་མེད་འཐོབ།
en: The unimpeded wisdom of the buddhas. “The same also applies to the ear, the nose,

source: །སེམས་ཅན་དག་ནི་བརྒྱ་སྟོང་སྙེད།
en: A hundred thousand sentient beings

source: །མཁའ་ལས་ཆོས་བཤད་སྒྲ་ཐོས་པས།
en: Heard those words of the Dharma manifested from the sky

source: །སངས་རྒྱས་ཡོན་ཏན་ཐེ་ཚོམ་མེད།
en: And became free of doubts concerning the qualities of the Buddha.

source: །ཁ་ཅིག་འདོད་ཆགས་སེམས་བྱུང་ཡང་།
en: Though desire arose in the minds of some of them,

source: །སངས་རྒྱས་ཡེ་ཤེས་འཇིགས་མི་བྱེད།
en: They were not scared by the Buddha’s wisdom.

source: །གང་ཞིག་འདོད་ཆགས་སེམས་བྱུང་ཡང་།
en: Though desire arose in the minds of some of them,

source: །སངས་རྒྱས་ཡོན་ཏན་སྟོར་མ་གྱུར།
en: They did not turn away from the Buddha’s qualities.

source: །བླ་མེད་ཡེ་ཤེས་ཚོལ་བྱེད་ཅིང་།
en: They pursued unsurpassed wisdom. They accomplished the unique qualities

source: །མ་འདྲེས་ཆོས་ནི་བསྒྲུབ་པ་དང་། །ཉན་ཐོས་ཐེག་པ་མོས་མི་བྱེད།
en: And had no interest in the vehicle of the hearers.

source: །བྱིས་པ་བསམ་གཏན་སྒོམ་བྱེད་ཀྱང་།
en: Immature beings might practice concentration,

source: །བསམ་གཏན་བདེ་ལ་མོས་པས་ན།
en: But since they are attracted to the bliss of concentration,

source: །མངོན་པའི་ང་རྒྱལ་རབ་བསྐྱེད་ནས།
en: They will develop manifest pride

source: །དགེ་སྦྱོང་འབྲས་བུ་ཐོབ་སྙམ་སེམས།
en: And think that they have achieved the fruition of virtuous practice.

source: །མི་ཟད་མཐའ་ཡི་ཤེས་མེད་ན།
en: But since they do not understand the limit of the exhaustion of the eye, They will never reach liberation,

source: །བསྐལ་པ་བརྒྱ་སྟོང་སྒོམ་བྱེད་ཀྱང་།
en: Even if they practice for a hundred thousand eons.

source: །དེ་ལ་རྣམ་གྲོལ་ཅི་ཡང་མེད།
en: They generate attachment

source: །སྐྱེ་བ་ལེན་པ་ཐམས་ཅད་ནི། །དེ་ལ་ཞེན་ཆགས་སྐྱེད་པར་བྱེད།
en: To all forms of rebirth,

source: །གལ་ཏེ་སྐྱེ་ཉིད་སྟོང་རིག་ན།
en: But if they were to understand the emptiness of birth itself,

source: །མཐོང་བ་རྣམས་ནི་རྣམ་དག་འགྱུར།
en: Their vision would become completely pure.

source: །གང་ཞིག་བསམ་གཏན་བཞི་བསྒྲུབས་ཀྱང་།
en: Some might have accomplished the four concentrations,

source: །མིག་ཟད་མཐའ་ཤེས་མེད་གྱུར་ན།
en: But if they lack an understanding of the limit of the exhaustion of the eye, Their concentration will never be pure,

source: །བསྐལ་པ་བརྒྱ་སྟོང་ལོན་ཡང་ནི། །བསམ་གཏན་ཡོངས་སུ་དག་མི་འགྱུར།
en: Even after a hundred thousand eons.

source: །གང་ཞིག་ཉེར་བསྡོགས་ཐོབ་གྱུར་ཀྱང་།
en: Even if they have reached the preparatory absorptions,

source: །ཟད་མཐའ་ཤེས་པ་འཐོབ་མི་འགྱུར།
en: They will not achieve an understanding of the limit of exhaustion,

source: །ཟད་པ་ཐོབ་པ་མ་ཤེས་ཕྱིར།
en: And since they have not understood the attainment of exhaustion,

source: །ཟག་པ་ཐོབ་ལ་རྟག་ཏུ་སྤྱོད།
en: They will always experience defiled attainment.

source: །གང་ཞིག་འདུ་ཤེས་ཞེན་བྱེད་པ།
en: Those who cling to perception

source: །འདུ་ཤེས་ཟད་མཐའི་ཤེས་པ་མེད།
en: Lack an understanding of the limit of the exhaustion of perception,

source: །འདུ་ཤེས་ཟད་པ་མ་ཤེས་ཕྱིར།
en: And since they have not understood the exhaustion of perception,

source: །རྟག་ཏུ་འདུ་ཤེས་ཟག་ལ་སྤྱོད།
en: They will always experience defiled perception.

source: །གང་ཞིག་འཇིག་རྟེན་ཞེན་ཆགས་པ།
en: Those who are attached to the world

source: །འཇིག་རྟེན་ཟད་མཐའ་ཤེས་པ་མེད།
en: Lack an understanding of the limit of the exhaustion of the world,

source: །འཇིག་རྟེན་ཟད་མཐའ་མ་ཤེས་ཕྱིར།
en: And since they have not understood the limit of the exhaustion of the world,

source: །རྟག་ཏུ་འཇིག་རྟེན་ཟག་ལ་སྤྱོད།
en: They will always experience a defiled world.

source: །གང་ཞིག་ཟག་བཅས་སེམས་ལ་གནས།
en: Those who abide by a defiled mind

source: །སེམས་ཟད་མཐའ་ཡི་ཤེས་པ་མེད།
en: Lack an understanding of the limit of the exhaustion of the mind,

source: །སེམས་ཟད་པ་ནི་མ་ཤེས་ཕྱིར།
en: And since they have not understood the exhaustion of the mind,

source: །རྟག་ཏུ་སེམས་ནི་ཟག་ལ་སྤྱོད།
en: They will always experience defiled mind.

source: །གང་ཞིག་ཟག་བཅས་ཆོས་ལ་གནས།
en: Those who dwell on defiled phenomena

source: །ཆོས་ཟད་མཐའ་ཡི་ཤེས་པ་མེད།
en: Lack an understanding of the limit of the exhaustion of phenomena,

source: །ཆོས་ཟད་པ་ནི་མ་ཤེས་ཕྱིར།
en: And since they have not understood the exhaustion of phenomena,

source: །རྟག་ཏུ་ཟག་བཅས་ཆོས་ལ་སྤྱོད།
en: They will always experience defiled phenomena.

source: །སྦྱངས་པའི་ཆོས་ལ་གནས་གྱུར་ཀྱང་།
en: Even if they abide by ascetic practices,

source: །མིག་ཟད་མཐའ་ཡི་ཤེས་མེད་ན།
en: If they lack an understanding of the limit of the exhaustion of the eye,

source: །མིག་ཟད་པ་ནི་མ་ཤེས་ཕྱིར།
en: Due to this lack of understanding of the eye’s exhaustion

source: །ཡང་དག་སྦྱངས་ལ་གནས་པ་མིན།
en: They will not observe genuine ascetic practices.

source: །ཁ་དོག་སྒྱུར་བའི་གོས་བགོས་ཀྱང་།
en: Even if they wear the saffron-colored robes,

source: །ཡང་དག་ཆོས་གོས་བགོས་མ་ཡིན།
en: They will not wear the genuine Dharma robes.

source: །ཡ་རབས་རིགས་སུ་སྐྱེས་གྱུར་ཀྱང་།
en: Even if they are born within high-class families,

source: །དེ་ནི་དག་པའི་རིགས་མ་ཡིན།
en: They will not belong to pure families.

source: །འཁོར་མང་དག་ནི་བདོག་གྱུར་ཀྱང་།
en: Even if they possess numerous retinues,

source: །མྱུར་དུ་ངན་འགྲོར་ལྷུང་འགྱུར་ཏེ།
en: They will quickly fall into the lower realms,

source: །འཁོར་དག་གིས་ནི་སྐྱོབ་མི་ནུས།
en: And their retinues will be unable to protect them.

source: །སྒྲ་ཡི་རིག་པ་མཁས་གྱུར་ཀྱང་།
en: Even if they are experts in grammar,

source: །སྒྲ་ཡི་རིག་པ་རྟོགས་མ་ཡིན།
en: They will not fully grasp the field of grammar.

source: །བཟོ་རྣམས་ལ་ནི་མཁས་གྱུར་ཀྱང་།
en: Even if they are experts in the sciences of craftsmanship,

source: །དེ་ནི་བཟོ་ལ་མཁས་མ་ཡིན།
en: They will not be truly competent in crafts.

source: །འདྲི་བ་མང་ལ་མཁས་གྱུར་ཅིང་།
en: Even if they are experts in many types of inquiries

source: །ཡི་གེ་གཅིག་གིས་རྣམ་འབྱེད་ཀྱང་།
en: And can reveal the teachings through a single word,

source: །དེ་ནི་དོན་འཐུན་བཤད་མ་ཡིན།
en: Their explanations will not accord with the true meaning.

source: །མཁས་པའི་རྗེས་སུ་སློབ་བྱེད་ཀྱང་།
en: Even if they learn under scholars,

source: །གསང་དང་གསང་མིན་མི་ཤེས་ཤིང་།
en: If they do not know what is secret and what is not,

source: །ཆོས་འདི་རྟོགས་པར་མི་འགྱུར་རོ།
en: They will not comprehend this teaching.

source: །བརྗོད་པ་སྣ་ཚོགས་རྒྱང་པན་དང་། །ཆོས་རྣམས་རབ་ཏུ་ཤེས་གྱུར་ཀྱང་།
en: Even if they clearly know a variety of verbal expressions, Worldly theories, and phenomena,

source: །འཁྲི་ཤིང་སྟུག་པོར་ལྷུང་བ་འདྲ།
en: It will be as if they have fallen into a thick creeping bush.

source: །སྒྲ་ཡི་རིག་པ་མཁས་གྱུར་ཅིང་།
en: Even if they are experts in grammar who teach the signs of virtue and nonvirtue

source: །དགེ་དང་མི་དགེའི་རྟགས་སྟོན་དང་། །ཚིག་འབྲུ་ཡི་གེ་སྒྲ་སྐད་དང་། །ཀློག་དང་འདོན་པའི་མཐར་ཐུག་ཀྱང་།
en: And have mastered letters, words, language, reading, and recitation,

source: །མིག་ཟད་མཐའ་ནི་མ་ཤེས་ན།
en: If they have not understood the limit of the exhaustion of the eye,

source: །དེ་དག་རྣམས་ནི་ཤེས་མེད་ཡིན།
en: They will lack an understanding of those topics.

source: །བུད་མེད་དག་གི་མཚན་མ་དང་། །ཚིག་མཁན་རྨོངས་པར་བྱེད་པ་དང་། །ལུས་མཉེས་ངལ་སོས་ཆོས་རྣམས་དང་། །མཁྱུད་དཔྱད་དག་ལ་མཁས་གྱུར་ཀྱང་།
en: Even if they are experts in female anatomy, in skillful words of seduction, Pleasing and soothing their body, and applying various treatments,

source: །གཞུང་ལུགས་བརྒྱ་མང་སྟོན་བྱེད་ཅིང་།
en: Even if they can teach hundreds of scriptural traditions

source: །ཡི་གེ་འབྲུ་གཅིག་མི་བརྗེད་ཀྱང་།
en: Without forgetting a single letter,

source: །བཤད་པ་དེ་ནི་དོན་མེད་ཡིན།
en: Their explanations will be meaningless. Know that the same applies

source: །དེ་བཞིན་མིག་སྐྱེ་མཐའ་དག་དང་། །མིག་མཐའ་དང་ནི་འཇུག་པ་ནས།
en: To the limit of the arising of the eye, Its limit, and its cognition,

source: །རབ་ཏུ་ཞི་བའི་བར་དུ་ཡང་།
en: Up to its utter peace.

source: །དེ་བཞིན་དུ་ནི་རིག་པར་གྱིས།
en: The same should also be applied to the ear, the nose,

source: །སྒྲ་ཡི་རིག་པ་ཀློག་འདོན་ཅིང་།
en: Even if they read and recite grammar

source: །དེ་ཡི་དོན་ནི་རྟོགས་གྱུར་ཀྱང་།
en: While understanding its meaning,

source: །དེ་ནི་ནམ་ཡང་དམན་པ་ཡིན།
en: Their knowledge will always be inferior.

source: །སྨྲང་གཞི་དག་ནི་འདོན་བྱེད་ཅིང་།
en: Even if they recite the basis of authoritative speech

source: །གསང་སྔགས་དག་ནི་རྟོགས་གྱུར་ཀྱང་།
en: And understand secret mantras,

source: །དེ་བཞིན་མིག་སྐྱེ་མཐའ་དག་དང་། །མིག་གི་མཐའ་དང་འཇུག་པ་ནས།
en: To the limit of the arising of the eye, Its limit, and its cognition,

source: །སྒྲ་དང་མིང་གི་བར་དུ་ཡང་། །ཐམས་ཅད་དེ་བཞིན་སྦྱར་བར་བྱ།། །།བམ་པོ་བཞི་པ།
en: Up to words and names.

source: བཅོམ་ལྡན་གྲོང་ཁྱེར་གཤེགས་པའི་ཚེ།
en: When the Blessed One came to the city,

source: །སེམས་ཅན་དག་ནི་ཚད་མེད་སྙེད།
en: Countless sentient beings

source: །མཁའ་ལས་ཆོས་བསྟན་སྒྲ་ཐོས་པས།
en: Heard those Dharma words manifested from the sky

source: །མིག་ཟད་མཐའ་ཡི་ཤེས་པ་ཐོབ།
en: And gained an understanding of the limit of the exhaustion of the eye.

source: །བཅོམ་ལྡན་གྲོང་ཁྱེར་གཤེགས་པའི་ཚེ། །སེམས་ཅན་དག་ནི་ཚད་མེད་སྙེད།
en: When the Blessed One came to the city, countless sentient beings

source: །མིག་གི་རང་བཞིན་རྟོགས་པར་གྱུར།
en: And realized the intrinsic nature of the eye.

source: །སྟོང་དང་བདག་མེད་རབ་རྟོགས་པས། །ཐམས་ཅད་རྣམ་དག་མིག་ཐོབ་འགྱུར།
en: Realizing emptiness and selflessness, they all achieved the pure eye. The same should be applied to everything

source: །རྣ་བ་སྣ་ལྕེ་ལུས་དང་ཡིད། །གཟུགས་སྒྲ་དྲི་རོ་རེག་བྱ་ནས།
en: From the ear, the nose, the tongue, the body, the mind, Forms, sounds, scents, tastes, and textures,

source: །ཐམས་ཅད་དེ་བཞིན་སྦྱར་བར་བྱ།
en: Know that the same also applies

source: །འདོད་སྡང་གཏི་མུག་ཁོང་ཁྲོ་དང་། །ང་རྒྱལ་ཁེངས་དང་གཡོ་སྒྱུ་ནས།
en: To desire, ignorance, aggression, Pride, arrogance, and deceit,

source: །བག་མེད་པ་ཡི་བར་དུ་ཡང་། །དེ་བཞིན་དུ་ནི་རིག་པར་གྱིས།
en: Up to carelessness.

source: །སྟེང་གི་ནམ་མཁའ་དག་ལས་ནི།
en: Heard from the sky

source: །སངས་རྒྱས་མཚན་ནི་སྣ་ཚོགས་ཐོས།
en: The various names of the Buddha. Some heard the name

source: །ཁ་ཅིག་འདོད་ཆགས་འཇིགས་པ་ཡི།
en: Unequaled One Who Scares Away Desire.

source: །དཔེ་ཟླ་མེད་པ་མིང་ཡང་ཐོས།
en: Some heard the name

source: །ཁ་ཅིག་ཞེ་སྡང་འཇིགས་བྱེད་ཅིང་། །འཇིག་རྟེན་ཕན་འདོགས་མིང་དག་ཐོས།
en: Benefactor of the World Who Scares Away Anger.

source: །ཁ་ཅིག་གཏི་མུག་རབ་རྟོགས་ཤིང་། །ང་རྒྱལ་འདུལ་བའི་མིང་དག་ཐོས།
en: Some heard the name Tamer of Pride Who Realizes the Nature of Ignorance.

source: །ཁ་ཅིག་འཇིག་རྟེན་དག་ལ་ནི། །རབ་ཞི་སྟོན་པའི་འདྲེན་མིང་ཐོས།
en: Some heard the name Great Guide Who Reveals Utter Peace to the World.

source: །ཁ་ཅིག་ཤེས་རབ་དག་བསྟན་ནས། །འཇིག་རྟེན་ཕན་འདོགས་མིང་དག་ཐོས།
en: Some heard the name Benefactor of the World Who Reveals Insight.

source: །ཁ་ཅིག་ཐབས་དག་རབ་བསྟན་ནས། །སེམས་ཅན་ཕན་འདོགས་མིང་དག་ཐོས།
en: Some heard the name Benefactor of Sentient Beings Who Teaches Methods.

source: །ཁ་ཅིག་བདུད་ནི་རབ་བཏུལ་ཀྱང་།
en: Some heard the name

source: །འཁོན་འཛིན་མེད་པའི་མིང་དག་ཐོས།
en: Subjugator of Māra Devoid of Resentment.

source: །ཁ་ཅིག་གསུང་རབ་ཆོས་དག་གིས། །རྣམ་གྲོལ་བསྟན་པའི་མིང་དག་ཐོས།
en: Some heard the name Revealer of Liberation through the Excellent Dharma Scriptures.

source: །ཁ་ཅིག་སེམས་ཅན་སྡུག་བསྔལ་བ། །རྒྱ་ཆེར་སྒྲོལ་བའི་མིང་དག་ཐོས།
en: Some heard the name Liberator of Sentient Beings’ Suffering on a Vast Scale.

source: །ཁ་ཅིག་མི་ཡི་གཙོ་བོ་ཡིས། །འཇིག་རྟེན་སྒྲོལ་བའི་མིང་དག་ཐོས།
en: Some heard the name Leader of Human Beings Who Liberates the World.

source: །མིང་ནི་དེ་དག་ཐོས་གྱུར་ནས། །ཐམས་ཅད་རྣམ་དག་མིག་ཐོབ་གྱུར།
en: Upon hearing those names, everyone achieved the pure eye.

source: །ནམ་མཁའ་དང་ནི་རྒྱ་མཚོའི་ཆུ།
en: Everything can be measured—including the vastness of the sky,

source: །རི་རབ་ལྷུན་པོའི་བར་དུ་ཡང་། །ཐམས་ཅད་གཞལ་དུ་རུང་སྲིད་ཀྱི།
en: The depths of the ocean, and the size of Mount Sumeru—

source: །སངས་རྒྱས་མཁྱེན་པ་ཐུབ་མི་འགྱུར།
en: But the wisdom of the Buddha cannot be fathomed.

source: །གང་ཞིག་མིག་ཟད་ངེས་པ་ཐོབ་གྱུར་ན།
en: For those who have gained certainty about the exhaustion of the eye,

source: །ཆོས་སྐུ་མངོན་པར་འགྲུབ་པ་དཀའ་མི་འགྱུར།
en: It will not be difficult to achieve the Dharma body,

source: །གང་ཞིག་ཆོས་སྐུ་མཆོག་ནི་གྲུབ་གྱུར་ན།
en: And those who have achieved the supreme Dharma body

source: །ཀུན་འཛིན་ཡེ་ཤེས་དཔག་མེད་ཐོབ་པར་འགྱུར།
en: Will attain the boundless, all-apprehending wisdom.

source: །གང་ཞིག་ཀུན་འཛིན་ཡེ་ཤེས་དཔག་མེད་ཐོབ།
en: Those who attain the boundless, all-apprehending wisdom

source: །དེས་ནི་མདོ་སྡེ་དཔག་མེད་གོ་བར་འགྱུར།
en: Will understand the boundless discourses,

source: །གང་ཞིག་མདོ་སྡེ་དཔག་མེད་གོ་གྱུར་པས།
en: And for those who understand the boundless discourses,

source: །སངས་རྒྱས་རྫུ་འཕྲུལ་འཐོབ་པ་དཀའ་མི་འགྱུར།
en: It will not be difficult to achieve the Buddha’s miraculous powers.

source: །གང་ཞིག་མིག་སྐྱེ་ངེས་པ་ཐོབ་གྱུར་ན།
en: For those who have gained certainty about the arising of the eye,

source: །ཀུན་འཛིན་ཡེ་ཤེས་དཔག་མེད་འཐོབ་པར་འགྱུར།
en: Will attain the boundless, all-apprehending wisdom.

source: །སངས་རྒྱས་རྫུ་འཕྲུལ་ཐོབ་པ་དཀའ་མི་འགྱུར།
en: It will not be difficult to achieve the Buddha’s miraculous powers.

source: །གཟུགས་སྒྲ་དྲི་རོ་རེག་བྱ་ཆོས་དག་ནས།
en: Forms, sounds, scents, tastes, textures, and mental phenomena,

source: །སྒྲ་རྣམས་དང་ནི་མིང་གི་བར་དུ་ཡང་། །ཐམས་ཅད་དེ་བཞིན་དུ་ནི་སྦྱར་བར་བྱ།
en: Up to words and names.

source: །དེ་ཚེ་ས་ཆེན་དག་ནི་རབ་ཏུ་གཡོས། །རྒྱ་མཚོ་རི་རྣམས་ཀྱང་ནི་དེ་བཞིན་ནོ།
en: At that moment, the great earth with its ocean and mountains started to shake,

source: །ལྷ་མ་ཡིན་དང་ལྷ་ནི་མང་པོ་རྣམས། །ཐམས་ཅད་རབ་ཏུ་དགའ་བ་སྐྱེས་པར་གྱུར།
en: And all the many asuras and gods became euphoric.

source: །བདུད་དང་བདུད་དཔུང་གཡོ་སྒྱུ་རབ་བཅོམ་ནས།
en: Everyone aspired to defeat the deceitful Māra and his armies,

source: །ཐམས་ཅད་སངས་རྒྱས་བཀོད་པ་བསྒྲུབ་པར་མོས།
en: And to achieve the state of buddhahood.

source: །ལྷ་རྣམས་སོ་སོར་གཞལ་མེད་ཁང་ཞུགས་ནས། །ཕན་ཚུན་དགའ་བའི་གཏམ་ནི་འདི་སྐད་སྨྲས།
en: Residing in their respective palaces, The gods joyfully exclaimed to one another,

source: །འདྲེན་པ་དེང་ནི་འཇིག་རྟེན་བྱུང་བས་ན།
en: “Today, the Great Guide has appeared in the world

source: །ལྷ་མི་ཐམས་ཅད་ལ་ནི་ཕན་པ་མཛད།
en: And benefitted all the gods and humans!”

source: །ས་བླའི་ལྷ་འཁོར་གཞལ་མེད་ཁང་གནས་ནས།
en: From their palaces, the retinues of gods residing above the earth

source: །དང་བའི་སེམས་ཀྱིས་དགའ་ནས་འདི་སྐད་དུ།
en: Exclaimed joyfully, filled with faith,

source: །འདྲེན་པ་འཇིག་རྟེན་དེང་བྱུང་ཤིན་ཏུ་ལེགས།
en: “Today, the Great Guide has appeared in the world; this is excellent!

source: །འཇིག་རྟེན་ཀུན་བདེ་རྒྱུ་ནི་རབ་ཏུ་མཛད།
en: He has brought happiness to all the world!”

source: །མཁའ་ལ་སྤྱོད་པའི་ལྷ་རྣམས་དེ་ཐོས་ནས། །ཐམས་ཅད་དགའ་ནས་རབ་ཏུ་དང་བ་སྐྱེས།
en: When they heard this, all the gods residing in the sky Were delighted, and intense faith arose in their minds.

source: །ཁྱད་འཕགས་སྒྲ་སྙན་སངས་རྒྱས་བསྔགས་བརྗོད་ནས།
en: With magnificent melodious voices, they praised the Buddha

source: །འདྲེན་པ་བྱུང་བས་འཇིག་རྟེན་ཕན་མཛད་ཟེར།
en: And said, “The Guide has come and benefitted the world!”

source: །རྒྱལ་ཆེན་རིགས་བཞིའི་ལྷ་རྣམས་དེ་ཐོས་ནས། །ཐམས་ཅད་དགའ་ནས་ཤིན་ཏུ་དང་བ་སྐྱེས།
en: When they heard this, all the gods of the Heaven of the Four Great Kings Were delighted, and intense faith arose in their minds.

source: །སུམ་ཅུ་རྩ་གསུམ་ལྷས་ནི་དེ་ཐོས་ནས། །ཐམས་ཅད་དགའ་ནས་ཤིན་དུ་དང་བ་སྐྱེས།
en: When they heard this, all the gods of the Heaven of the Thirty-Three Were delighted, and intense faith arose in their minds.

source: །འཐབ་བྲལ་ལྷ་དག་དེ་སྐད་ཐོས་ནས་ནི།
en: When they heard this, all the gods of the Heaven Free from Strife

source: །ཐམས་ཅད་དགའ་ནས་ཤིན་དུ་དང་བ་སྐྱེས།
en: Were delighted, and intense faith arose in their minds.

source: །འདྲེན་པ་བྱུང་ནས་འཇིག་རྟེན་ཕན་མཛད་ཟེར།
en: And said, “The Great Guide has come and benefitted the world!

source: །བདག་ཅག་བྱང་ཆུབ་སེམས་ནི་རབ་བསྐྱེད་ནས།
en: “We will give rise to the mind set on awakening

source: །བཅོམ་ལྡན་བླ་མེད་མཁྱེན་པ་ཉེ་བར་བགྱི།
en: And venerate the unsurpassed wisdom of the Blessed One!

source: །ལྷ་མིའི་གཙོ་མཆོག་ལ་ནི་བརྟེན་ནས་སུ།
en: We will follow the perfect leader of gods and humans

source: །སེམས་ཅན་ཐམས་ཅད་སྒྲོལ་བར་བགྱིད་ཅེས་ཟེར།
en: And liberate all sentient beings!”

source: །དགའ་ལྡན་ལྷ་རྣམས་དེ་སྐད་ཐོས་ནས་ཀྱང་།
en: When they heard this, all the gods of the Heaven of Joy

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བསྐལ་པ་བྱེ་བར་ནི།
en: Boundless practices for ten million eons,

source: །སྤྱོད་མཆོག་ཁྱད་འཕགས་དཔག་མེད་མངོན་བསྒྲུབས་ནས། །སེམས་ཅན་སྡུག་བསྔལ་བ་ལ་བདེ་ལམ་བསྟན།
en: The Blessed One has revealed the path of happiness to suffering beings.

source: །འཁོར་བ་བསྒྲལ་ནས་མྱ་ངན་འདས་ལ་བཀོད།
en: He has liberated them from saṃsāra and established them in nirvāṇa!”

source: །འཕྲུལ་དགའི་ལྷ་རྣམས་དེ་སྐད་ཐོས་ནས་ནི།
en: When they heard this, all the gods of the Heaven of Delighting in Emanations

source: །གཞན་འཕྲུལ་དབང་བྱེད་ལྷས་ནི་དེ་ཐོས་ནས།
en: When they heard this, all the gods of the Heaven of Making Use of Others’ Emanations

source: །དེ་བཞིན་གཤེགས་པ་སྐྱེ་ཤི་འདས་པས་ན།
en: “Since the Thus-Gone One has transcended birth and death,

source: །བདུད་དང་མུ་སྟེགས་མང་པོ་ཕམ་པར་མཛད།
en: He has defeated many demons and non-Buddhists;

source: །བླ་མེད་བྱང་ཆུབ་དག་ནི་ཡོངས་རྫོགས་ནས།
en: He has perfected unsurpassed awakening

source: །སྐྱེ་དགུ་དྲངས་ནས་ཕ་རོལ་འཇོག་ཅེས་ཟེར།
en: And guided many beings to the other shore!”

source: །ཚངས་རིས་ལྷ་རྣམས་དེ་སྐད་ཐོས་ནས་ཀྱང་།
en: When they heard this, all the gods of the Brahmā realms

source: །དེ་བཞིན་གཅིག་ནས་གཅིག་ཏུ་སྒྲ་ཐོས་པས།
en: When they heard those words passing from one group to another,

source: །ཚངས་པའི་འཁོར་རྣམས་དགའ་ནས་འདི་སྐད་དུ།
en: The gods of the Heaven of Brahmā’s Retinue joyfully exclaimed,

source: །འདྲེན་པ་བྱུང་བས་འཇིག་རྟེན་ཕན་པ་མཛད།
en: “The Great Guide has come and benefitted the worlds!

source: །བདུད་དཔུང་འཇིགས་སྐྲག་མྱ་ངན་བྱེད་ཅེས་ཟེར།
en: He scares away and frightens the armies of Māra!”

source: །སྲིད་པའི་རྩེ་མོའི་ལྷ་ཡི་བར་དུ་ཡང་།
en: Everyone up to the gods of the Peak of Existence heard those words:

source: །སངས་རྒྱས་བྱུང་ནས་འཇིག་རྟེན་ཕན་མཛད་ཐོས།
en: “The Buddha has come and benefitted the world!”

source: །དེ་བཞིན་སྒྲ་ནི་ཀུན་དུ་གྲགས་པས་ན།
en: As those words resounded everywhere,

source: །ལྷ་མ་ཡིན་དག་འགྲིབས་ཤིང་ལྷ་རྣམས་འཕེལ།
en: The asuras decreased and the gods increased in number.

source: །བདུད་ཀྱི་ཁང་པ་དག་ནི་ཡོངས་སྟོངས་ཤིང་།
en: The houses of the demons became empty,

source: །ལྷ་རྣམས་འཁོར་ནི་རབ་ཏུ་རྒྱས་པར་གྱུར།
en: While the retinues of gods multiplied.

source: །མི་འཇིགས་སྟོབས་ཀྱིས་ལོག་པ་རབ་བཏུལ་ནས།
en: Through the power of fearlessness, all beings overcame their wrong views

source: །བྱང་ཆུབ་ཆེན་པོ་མཆོག་ནི་མྱུར་དུ་བརྙེས།
en: And swiftly reached supreme awakening.

source: །དེ་བཞིན་སྐད་ཅིག་ཡུད་ཙམ་ལྷ་རྣམས་ཀྱིས།
en: The very moment the gods heard those words,

source: །བཅོམ་ལྡན་བྱུང་ནས་ཕན་མཛད་ཐོས་གྱུར་ནས།
en: “The Blessed One has come and benefitted the world,”

source: །འཇིག་རྟེན་འདྲེན་པར་མཛད་པ་ཤིན་དུ་ལེགས།
en: They exclaimed, “The Guide of the World is excellent!

source: །རྣམ་དག་མིག་ནི་སེམས་ཅན་སྦྱིན་ཞེས་ཟེར།
en: He bestows the pure eye on sentient beings!”

source: །འདོད་པས་ཡོངས་སུ་གདུངས་པ་རྣམས།
en: Those who were tormented by desire

source: །མི་གཙང་བསྒོམ་པ་བཤད་ཐོས་པས།
en: Heard instructions on the meditation on impure substances;

source: །འདོད་ཆགས་ཞི་སྟེ་མ་ལུས་སྤངས།
en: Thereby, their desire was pacified and entirely abandoned.

source: །ཞེ་སྡང་དག་གིས་གདུངས་པ་རྣམས།
en: Those who were tormented by anger

source: །བྱམས་པ་བསྟན་པའི་ཆོས་ཐོས་པས།
en: Heard Dharma teachings on love;

source: །ཞེ་སྡང་ཞི་སྟེ་མ་ལུས་སྤངས།
en: Thereby, their anger was pacified and entirely abandoned.

source: །གཏི་མུག་དག་གིས་གདུངས་པ་རྣམས།
en: Those who were tormented by ignorance

source: །ཤེས་རབ་ཆོས་ནི་བསྟན་ཐོས་པས།
en: Heard Dharma teachings related to insight;

source: །གཏི་མུག་ཞི་སྟེ་མ་ལུས་སྤངས།
en: Thereby, their ignorance was pacified and entirely abandoned.

source: །ང་རྒྱལ་དག་གིས་གདུངས་པ་རྣམས།
en: Those who were tormented by pride

source: །ང་རྒྱལ་སྤངས་པའི་ཆོས་ཐོས་པས།
en: Heard Dharma teachings related to the abandonment of pride;

source: །ང་རྒྱལ་ཞི་སྟེ་མ་ལུས་སྤངས།
en: Thereby, their pride was pacified and entirely abandoned.

source: །ཕྲག་དོག་དག་གིས་གདུངས་པ་རྣམས།
en: Those who were tormented by envy

source: །ཕྲག་དོག་སྤངས་པའི་ཆོས་ཐོས་པས།
en: Heard Dharma teachings related to the abandonment of envy;

source: །ཕྲག་དོག་ཞི་སྟེ་མ་ལུས་སྤངས།
en: Thereby, their envy was pacified and entirely abandoned.

source: །ཁོང་ཁྲོ་དག་གིས་གདུངས་པ་རྣམས།
en: Those who were tormented by aggression

source: །ཁོང་ཁྲོ་སྤངས་པའི་ཆོས་ཐོས་པས།
en: Heard Dharma teachings related to the abandonment of aggression;

source: །ཁོང་ཁྲོ་ཞི་སྟེ་མ་ལུས་སྤངས།
en: Thereby, their aggression was pacified and entirely abandoned.

source: །སེར་སྣ་དག་གིས་གདུངས་པ་རྣམས།
en: Those who were tormented by miserliness

source: །སེར་སྣ་སྤངས་པའི་ཆོས་ཐོས་པས།
en: Heard Dharma teachings related to the abandonment of miserliness;
